smq100/inish-stm32cube-template/Application/ClassB/src/classb.c
/*!
 ******************************************************************************
 * @copyright Copyright (c) 2026 Inish Corporation
 *
 * SPDX-License-Identifier: MIT
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 ******************************************************************************

 @file    classb.c
 @brief   Source file for ClassB functionality
 @author  Steve Quinlan
          Portions adapted from STMicroelectronics Class B library
          https://www.st.com/en/embedded-software/stm32-classb-spl.html
 @date    2026-March

 ******************************************************************************/

#define CLASSB_PROTECTED

#include "main.h"
#include "task_system.h"
#include "task_led.h"
#include "classb.h"
#include "classb_startup.h"
#include "classb_vars.h"
#include "classb_params.h"
#include "log.h"
#include "eeprom_mcu.h"
#include "util.h"
#include "timer.h"
#include "dma.h"
#include "adc.h"
#include "stm32l1xx_ll_adc.h"

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  bool Enabled;
  bool PreInit;
  bool Always;
  const char* Name;
  fnClassBHandler_Startup* Handler;
} tClassbStartConfig;

typedef struct
{
  bool Enabled;
  const char* Name;
} tClassbRunConfig;

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Public variables ----------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
static const char* _Module = "CLSB";  //!< Module Name for debug logging

static bool _FaultInjection[eClassBRunItem_NUM] = { false };  //!< Fault injection flags

// clang-format off
// Order must match tClassBStartItem enum
static const tClassbStartConfig _StartConfig[] = {
  { true, true,  true,  "sInit1",     Start_Init1 },
  { true, true,  false, "sInit2",     Start_Init2 },
  { true, true,  false, "sRAM",       Start_RAMTest },
  { true, true,  false, "sCPU",       Start_CPUTest },

#ifndef TEST__ENABLE_DEBUG
  { true, false, false, "sIWDG",      Start_IWDGTest },
#else
  { false, false, false, "sIWDG",      Start_IWDGTest },
#endif

  { true, false, false, "sCRC",       Start_CRCTest },
  { true, false, false, "sCLK" ,      Start_CLKTest },
  { true, false, false, "sADC" ,      Start_ADCTest },
  { true, false, false, "sFlow",      Start_FLOWTest },
  { true, false, true,  "sComplete",  Start_Complete },
};

// Order must match tClassBRunItem enum
static const tClassbRunConfig _RunConfig[] = {
  { true, "rCPU" },
  { true, "rRAM" },
  { true, "rCRC" },
  { true, "rADC" },

#ifndef TEST__ENABLE_DEBUG
  { true, "rCLK" },
  { true, "rWDG" },
#else
  { false, "rCLK" },
  { false, "rWDG" },
#endif

  { true, "rStack" },
  { true, "rFlow" },
};
// clang-format on

static_assert(sizeof(_StartConfig) / sizeof(tClassbStartConfig) == eClassBStartItem_NUM, "start size mismatch");
static_assert(sizeof(_RunConfig) / sizeof(tClassbRunConfig) == eClassBRunItem_NUM, "run size mismatch");

static bool _IwdgDisabled = false;

// Startup test status (stored in .noinit RAM section so preserved across sw resets)
static uint32_t _StartTestStatus[eClassBStartItem_NUM] __attribute__((section(".noinit")));

/* Private function prototypes -----------------------------------------------*/

/* Public Implementation -----------------------------------------------------*/

/*******************************************************************/
/*!
 @brief     Initializes ClassB variables
 @param     force : true to force initialization of variables, false to only initialize if not already set
             (e.g. from previous classb startup test before reset)
 @return    Status indicating whether variables were initialized (true) or
            preserved from previous run (false)
 *******************************************************************/
bool ClassB_InitVars(bool Force)
{
  bool reset = false;
  uint32_t reset_cause = Force ? 0 : GetResetCause();

  if (reset_cause & RCC_CSR_SFTRSTF)
  {
    // Software reset detected; ignore
  }
  else if (reset_cause & RCC_CSR_IWDGRSTF)
  {
    // IWDG reset detected; ignore
  }
  else
  {
    for (int i = 0; i < eClassBStartItem_NUM; i++)
    {
      _StartTestStatus[i] = TEST_CLASSB_NOINIT;
    }

    for (int i = 0; i < eClassBRunItem_NUM; i++)
    {
      _FaultInjection[i] = false;
    }

    // Clear RAM test status in RTC backup register
    RTC_HandleTypeDef hrtc = { 0 };
    hrtc.Instance = RTC;
    static_assert(RTC_RAMCHECK_STATUS_REG <= RTC_BKP_DR4);
    (void)HAL_RTCEx_BKUPWrite(&hrtc, RTC_RAMCHECK_STATUS_REG, TEST_CLASSB_NOINIT);

    reset = true;
  }

  // Make sure all tests have a valid state regardless of reset cause
  for (int i = 0; i < eClassBStartItem_NUM; i++)
  {
    if (!_StartConfig[i].Enabled)
    {
      _StartTestStatus[i] = TEST_CLASSB_DISABLED;
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_NOINIT)
    {
      // Ignore
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_INPROGRESS)
    {
      // Ignore
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_PASS)
    {
      // Ignore
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_FAIL)
    {
      // Ignore
    }
    else
    {
      _StartTestStatus[i] = TEST_CLASSB_NOINIT;
    }
  }

  return reset;
}

/*******************************************************************/
/*!
 @brief     Performs ClassB startup tests
 @param     PreInit : true to run pre-initialization tests
                      false to run post-initialization tests
 @return    None
*******************************************************************/
void ClassB_DoStartUpTests(bool PreInit)
{
  for (tClassBStartItem i = 0; i < eClassBStartItem_NUM; i++)
  {
    if (_StartConfig[i].PreInit != PreInit)
    {
      // Skip tests not matching the preInit specification
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_PASS && !_StartConfig[i].Always)
    {
      print("Skipping startup test previously PASSED: %s\n\r", _StartConfig[i].Name);
    }
    else if (_StartTestStatus[i] == TEST_CLASSB_FAIL && !_StartConfig[i].Always)
    {
      print("Skipping startup test previously FAILED: %s\n\r", _StartConfig[i].Name);
      break;
    }
    else
    {
      print("Running startup test: %s (pre=%d)\n\r", _StartConfig[i].Name, PreInit);
      bool success = _StartConfig[i].Handler(_StartConfig[i].Enabled, &_StartTestStatus[i]);
      _StartTestStatus[i] = success ? TEST_CLASSB_PASS : TEST_CLASSB_FAIL;

      if (success)
      {
        print("Startup test PASSED: %s\n\r", _StartConfig[i].Name);
      }
      else
      {
        ClassB_Fail_Startup(i);  // Does not return. TODO?
      }
    }
  }
}

/*******************************************************************/
/*!
 @brief   Returns whether specified startup test passed
 @param   test : Test to check
 @return  true if test passed, false otherwise
*******************************************************************/
bool ClassB_IsStartupPass(tClassBStartItem Test)
{
  if (Test >= eClassBStartItem_NUM)
  {
    return false;
  }
  return (_StartTestStatus[Test] == TEST_CLASSB_PASS);
}

/*******************************************************************/
/*!
 @brief   Returns whether all startup tests passed
 @param
 @return  true if all tests passed, false otherwise
*******************************************************************/
bool ClassB_IsAllStartupPass(void)
{
  bool success = true;
  for (tClassBStartItem i = 0; i < eClassBStartItem_NUM; i++)
  {
    if (_StartConfig[i].Enabled && (_StartTestStatus[i] != TEST_CLASSB_PASS))
    {
      success = false;
      break;
    }
  }

  return success;
}

/*******************************************************************/
/*!
 @brief   Disables IWDG for testing purposes
 @param   None
 @return  None
*******************************************************************/
void ClassB_ExpireIWDG(void)
{
  print("Disabled IWDG. Waiting for reset...\r\n");
  _IwdgDisabled = true;
}

/*******************************************************************/
/*!
 @brief   Checks if IWDG test is in progress
 @param   None
 @return  true if IWDG test is in progress, false otherwise
*******************************************************************/
bool ClassB_IsTestingIWDG(void)
{
  return _IwdgDisabled;
}

/*******************************************************************/
/*!
 @brief   Prints the status of all startup tests
 @param   None
 @return  None
*******************************************************************/
void ClassB_PrintStatus(void)
{
  for (int i = 0; i < eClassBStartItem_NUM; i++)
  {
    const char* status_str;
    switch (_StartTestStatus[i])
    {
      case TEST_CLASSB_NOINIT:
        status_str = "PENDING";
        break;
      case TEST_CLASSB_INPROGRESS:
        status_str = "IN PROGRESS";
        break;
      case TEST_CLASSB_PASS:
        status_str = "PASS";
        break;
      case TEST_CLASSB_FAIL:
        status_str = "FAIL";
        break;
      case TEST_CLASSB_DISABLED:
        status_str = "DISABLED";
        break;
      default:
        status_str = "UNKNOWN";
        break;
    }
    print("ClassB Startup test '%s': %s\n\r", _StartConfig[i].Name, status_str);
  }
}

/*******************************************************************/
/*!
 @brief   Detect if firmware was loaded via debugger vs flash programmer
 @param   None
 @return  true if loaded via debugger, false if flashed normally
*******************************************************************/
bool ClassB_LoadedViaDebugger(void)
{
  bool debugger_present;

  // Check if CRC reference is erased flash pattern. Linker sets REF_CRC32 to 0xFFFFFFFF
  uint32_t crc_value = *(uint32_t*)(&REF_CRC32);
  debugger_present = (crc_value == 0xFFFFFFFF);

  return debugger_present;
}

/*******************************************************************/
/*!
 @brief   Checks if a runtime test is Enabled
 @param   test : Test to check
 @return  true if test is Enabled, false otherwise
*******************************************************************/
bool ClassB_IsRuntimeTestEnabled(tClassBRunItem Test, char* Name)
{
  bool enabled = false;

  if (Test < eClassBRunItem_NUM)
  {
    enabled = _RunConfig[Test].Enabled;

    if (Name != NULLPTR)
    {
      strcpy(Name, _RunConfig[Test].Name);
    }
  }

