smq100/inish-stm32cube-template/Application/ClassB/src/classb.c
  return enabled;
}

/*******************************************************************/
/*!
 @brief   Executed in case of failure is detected by one of self-test startup routines
 @param   test : Test that failed
 @return  None
*******************************************************************/
void ClassB_Fail_Startup(tClassBStartItem Test)
{
  print("Startup test '%s' FAILED. Halting execution.\n\r", _StartConfig[Test].Name);

  while (true)
  {
    HAL_IWDG_Refresh(&hIWDG_APP);

    HAL_GPIO_TogglePin(LED_STATUS_GPIO_Port, LED_STATUS_Pin);
    HAL_Delay(100);
  }
}

/*******************************************************************/
/*!
 @brief   Executed in case of failure is detected by one of self-test runtime routines
 @param   test : Test that failed
 @return  None
*******************************************************************/
void ClassB_Fail_Runtime(tClassBRunItem Test)
{
  LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "Runtime test '%s' failed.", _RunConfig[Test].Name);

  // Flash the LED based on the test that failed. test+1 so test 0 pulses once.
#ifndef HW_IS_NUCLEO
  LED_Pulse(eLED_Error, 1.0f, -1, (int32_t)(Test + 1), "");
#else
  SYSTEM_SetStatusLED(eStatusLED_Error, (int8_t)(Test + 1));
#endif
}

/*******************************************************************/
/*!
 @brief   Executed in case of entering a runtime test. Used for control flow testing
 @return  None
*******************************************************************/
void ClassB_ControlFlowInit(void)
{
  ClassB_SetVar(eClassBVar_RUN_FLOW_CNT_U32, (tDataValue){ .U32 = 0u });
}

/*******************************************************************/
/*!
 @brief   Executed in case of entering a runtime test. Used for control flow testing
 @param   a : value to add to control flow counter
 @return  None
*******************************************************************/
void ClassB_ControlFlowEnter(uint32_t A)
{
  extern tDataValue ClassBData[];
  ClassBData[eClassBVar_RUN_FLOW_CNT_U32].U32 += A;
}

/*******************************************************************/
/*!
 @brief   Executed in case of exiting a runtime test. Used for control flow testing
 @param   a : value to subtract from control flow counter
 @return  None
*******************************************************************/
void ClassB_ControlFlowExit(uint32_t A)
{
  extern tDataValue ClassBDataInv[];
  ClassBDataInv[eClassBVar_RUN_FLOW_CNT_U32].U32 -= A;
}

/*******************************************************************/
/*!
 @brief   Returns the name of a runtime test
 @param   test : Test to get the name of
 @return  Name of the runtime test
*******************************************************************/
const char* ClassB_GetRuntimeName(tClassBRunItem Test)
{
  const char* name = NULLPTR;

  if (Test < eClassBRunItem_NUM)
  {
    name = _RunConfig[Test].Name;
  }

  return name;
}

/*******************************************************************/
/*!
 @brief   Runs the clock test, which measures the LSI period using
          TIM10 input capture and checks if it's within expected limits
 @param   startup : Indicates if the test is run during startup or runtime
 @return  Status of the clock test
*******************************************************************/
tClockStatus ClassB_RunCLKTest(bool Startup)
{
  tClockStatus clck_sts = TEST_ONGOING;

  ClassB_ControlFlowEnter(Startup ? FLOW_START_CLK2 : FLOW_RUNTIME_CLK2);

  __HAL_TIM_CLEAR_FLAG(&hTIM_CLKTEST, TIM_FLAG_CC1);
  if (HAL_TIM_IC_Start_IT(&hTIM_CLKTEST, TIM_CLKTEST_CH) == HAL_OK)
  {
    // Wait for two subsequent LSI periods measurements
    // Use sequence counter approach to ensure we capture fresh measurements
    // and avoid race conditions with the timer interrupt updating the flags

    uint32_t start_count = ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_FLAG_V32).V32;

    // Wait for first new measurement (flag increment)
    uint32_t timeout = TIMER_GetTick() + 150u;  // 150 ms timeout
    while (ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_FLAG_V32).V32 == start_count)
    {
      if (TIMER_GetTick() > timeout)
      {
        LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "CLK test timeout waiting for LSI period 1");
        clck_sts = MCO_START_TIM_FAIL;
        break;
      }
    }

    if (clck_sts == TEST_ONGOING)
    {
      start_count = ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_FLAG_V32).V32;

      // Wait for second new measurement (another flag increment)
      timeout = TIMER_GetTick() + 150u;  // 150 ms timeout
      while (ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_FLAG_V32).V32 == start_count)
      {
        if (TIMER_GetTick() > timeout)
        {
          LOG_Write(eLogger_Sys, eLogLevel_Error, _Module, true, "CLK test timeout waiting for LSI period 2");
          clck_sts = MCO_START_TIM_FAIL;
          break;
        }
      }
    }

    uint32_t period = ClassB_GetVar(eClassBVar_RUN_LSI_PERIOD_VALUE_V32).V32;

    // LSI_MEASURE_PRESCSALER must the same as TIM10_CLK_TEST_FREQ IC prescaler
    const uint32_t limit_low = SYS_LIMIT_LOW(SYSCLK_AT_RUN);
    const uint32_t limit_high = SYS_LIMIT_HIGH(SYSCLK_AT_RUN);

    if (_FaultInjection[eClassBRunItem_CLK] && !Startup)
    {
      // Force clock failure by injecting out-of-range value
      period = limit_high + 1000uL;
      _FaultInjection[eClassBRunItem_CLK] = false;
    }

    // Assign status
    if (clck_sts == MCO_START_TIM_FAIL)
    {
      // Already failed to get LSI periods
    }
    else if (period < limit_low)
    {
      // Below expected
      LOG_Write(
        eLogger_Sys, eLogLevel_Error, _Module, true, "CLK test FAIL: period %lu below limit %lu", period, limit_low);
      clck_sts = SYSCLK_LOW;
    }
    else if (period > limit_high)
    {
      LOG_Write(
        eLogger_Sys, eLogLevel_Error, _Module, true, "CLK test FAIL: period %lu above limit %lu", period, limit_high);
      clck_sts = SYSCLK_HIGH;
    }
    else
    {
      LOG_Write(eLogger_Sys,
                eLogLevel_Low,
                _Module,
                true,
                "CLK test PASS: period %lu within limits %lu/%lu",
                period,
                limit_low,
                limit_high);

